#pragma once
using namespace DirectX;

//*********************************************************************************************************************
//
//	ModelSubset サブセット
//
//*********************************************************************************************************************
struct ModelSubset
{
	unsigned short _StartIndex;
	unsigned short _IndexNum;
	Material _Material;
};


//*********************************************************************************************************************
//
//	NodeMesh
//
//*********************************************************************************************************************
struct NodeMesh final
{
	using MeshType = Mesh;

	std::string _NodeName;

	//オフセット行列
	XMMATRIX _OffsetMatrix;

	//メッシュ
	std::weak_ptr<Mesh> _Mesh;

	//サブセット
	ModelSubset* _SubsetArray;
	unsigned short _SubsetNum;

	~NodeMesh();
};

//*********************************************************************************************************************
//
//	Model
//
//*********************************************************************************************************************
class Model
{
private:

public:
	std::vector<NodeMesh*> _NodeMeshArray;
	virtual~Model();
};